``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.beacon-import-galaxyproject will be updated in-place
  ~ resource "aws_route53_record" "beacon-import-galaxyproject" {
        id              = "Z386N8B8JBC6TQ_beacon-import.galaxyproject.eu_A"
        name            = "beacon-import.galaxyproject.eu"
      ~ records         = [
          - "10.5.68.201",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.galaxyproject_eu_dmarc_txt will be created
  + resource "aws_route53_record" "galaxyproject_eu_dmarc_txt" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc.galaxyproject.eu"
      + records         = [
          + "v=DMARC1;p=reject;pct=100;ruf=mailto:galaxy-ops@informatik.uni-freiburg.de;aspf=r",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # aws_route53_record.galaxyproject_eu_spf_txt will be created
  + resource "aws_route53_record" "galaxyproject_eu_spf_txt" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "v=spf1 -all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # aws_route53_record.it-subdomain-main[14] will be created
  + resource "aws_route53_record" "it-subdomain-main" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.interactivetoolentrypoint.interactivetool.test.internal.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.usegalaxy_eu_dmarc_txt will be created
  + resource "aws_route53_record" "usegalaxy_eu_dmarc_txt" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_dmarc.usegalaxy.eu"
      + records         = [
          + "v=DMARC1;p=reject;pct=100;ruf=mailto:galaxy-ops@informatik.uni-freiburg.de;aspf=r",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # aws_route53_record.usegalaxy_eu_spf_txt will be created
  + resource "aws_route53_record" "usegalaxy_eu_spf_txt" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + records         = [
          + "v=spf1 include:mailgun.org -all",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # openstack_compute_instance_v2.beacon-import must be replaced
-/+ resource "openstack_compute_instance_v2" "beacon-import" {
      ~ access_ip_v4        = "10.5.68.201" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "47d55447-e763-4e8e-9601-b94cfd7be63d" -> (known after apply)
      ~ id                  = "833636a4-0d85-4f9f-844e-245e18d839f8" -> (known after apply)
      ~ image_id            = "c3c20662-1431-45f8-a17e-4528efc89ab0" -> "f5d4abb8-5c5b-49f6-a36b-6bdf30871932" # forces replacement
      ~ image_name          = "Image not found" -> (known after apply)
        name                = "beacon-import.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (7 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "10.5.68.201" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:54:5a:07" -> (known after apply)
            name           = "bioinf"
          + port           = (known after apply)
          ~ uuid           = "7de249b6-6d32-44e3-b50c-291939868d2f" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 6 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```